{
  "article": [
    {
      "championships": "WBA Heavyweight (4X), WBC Heavyweight (2X)",
      "description": [
        "The Greatest is the best heavyweight of all time. Ali fought with a style and a flamboyance that made you either love him or hate him. But regardless of where you come down, nobody can deny his place in boxing history or as a cultural icon.\n        Ali, then fighting under his birth name of Cassius Clay, won his first heavyweight title at 22 years old against Sonny Liston. \n        He later converted to Islam and became a controversial figure for refusing to serve in the Vietnam War, a conflict he opposed on religious and moral grounds. Ali was stripped of his heavyweight title and did not fight for four years as a result.\n        Ali is known for his trilogy with Joe Frazier, losing the first but winning the next two, and for utilizing his famed \"rope-a-dope\" style to upset George Foreman in the Congo in 1974 to regain his titles.\n        The tactic caused Foreman to expend tremendous energy firing punches in Ali's guard. Most of the shots were deflected or blocked and led to Ali stopping an exhausted Foreman in the eighth round.\n        In his illustrious career, Ali also holds victories over Bob Foster, Ken Norton, Jimmy Ellis and Floyd Patterson. He is the first man (and thus far, only man) to ever hold the Lineal Heavyweight Championship three times."
      ],
      "name": "Mohamed Ali",
      "number": "1",
      "records": "56-5, 37 KO",
      "YearsActive": "1960-1981"
    },
    {
      "championships": "Undisputed Heavyweight Championship, IBF Heavyweight, WBC/WBA Heavyweight (2X each)",
      "description": [
        "The Baddest Man on the Planet was a force in the heavyweight division during the late 1980s and early 1990s. His punching power and persona were enough to intimidate most anyone, and many fighters were defeated before they ever stepped in the ring.\n          Tyson is the youngest man in history, at just 20 years and a shade over 4 months old, to win the Undisputed Heavyweight Championship. In doing so, he became the first man to ever unify and hold the WBC, IBF and WBA heavyweight titles at the same time. "
      ],
      "name": "Mike Tyson",
      "number": "2",
      "records": "50-6, 2 NC, 44 KO",
      "YearsActive": "1985-2005"
    },
    {
      "championships": "Eight in five weight divisions (WBC Super Featherweight, WBC Lightweight, WBC Junior Welterweight, IBF Welterweight, WBC Welterweight (2X), WBC Junior Middleweight, WBA Junior Middleweight)",
      "description": [
        "There might never again be a fighter with the pure talent level of Floyd Mayweather Jr. He's a defensive specialist with a boxing IQ that may never be matched. \n            He has won multiple world titles in three weight divisions and has beaten an impressive list of opponents. But this also provides a level of criticism against him as well. There are many who argue that Mayweather has never truly measured himself against a top-level contemporary fighter while both were in their primes.\n            Those people must have missed his 2001 demolition of Diego Corrales. Whether you love him or hate him, there is no questioning his place amongst the all-timers. "
      ],
      "name": "Floyd Mayweather Jr.",
      "number": "3",
      "records": "43-0, 26 KO",
      "YearsActive": "1996-Present"
    },
    {
      "championships": "WBC/IBF Heavyweight Champion ",
      "description": [
        "Larry Holmes won his first 48 fights, held the WBC Heavyweight Championship for five years and the IBF title for two years. During his reign, he made 20 successful defenses. This is second in heavyweight history to only the great Joe Louis.\n                Holmes' left jab is still considered one of the most lethal weapons in the history of the sport.  "
      ],
      "name": "Larry Holmes",
      "number": "4",
      "records": "69-6, 44 KO",
      "YearsActive": "1973-2002"
    },
    {
      "championships": "Six titles in five weight divisions (WBA Welterweight, WBC Junior Middleweight, WBC Middleweight, WBO Super Middleweight, WBC/WBA Light Heavyweight) ",
      "description": [
        "Tommy Hitman Hearns holds, among his many distinctions, the distinction of being the first man to win four world titles in four weight divisions and then five in five divisions. \n                  He is best known for his tremendous fights with Sugar Ray Leonard, Marvin Hagler and Roberto Duran. It was a loaded time for the sport of boxing, and while Hearns was only able to defeat Duran amongst this group, there is no shame in that fact.  "
      ],
      "name": "Tommy Hearns",
      "number": "5",
      "records": "61-5-1, 48 KO",
      "YearsActive": "1977-2006"
    },
    {
      "championships": "Eight world titles in four weight divisions (IBF Middleweight, IBF Super Middleweight, WBC/WBA Light Heavyweight (2X each), IBF Light Heavyweight, WBA Heavyweight)",
      "description": [
        "Roy Jones Jr. held so many world titles at one point, he needed an entire entourage just to carry the belts to the ring. He is one of the most dominant light heavyweight's in history, and in his prime, rarely found a legitimate challenge.\n                    Jones often receives criticism for having dominated an era without many serious foes. But he does hold wins over Bernard Hopkins, James Toney, Mike McCallum and Virgil Hill.\n                    He is also the only man in history to begin his career below middleweight, Jones started at 154 pounds, and still win a share of the heavyweight title.  "
      ],
      "name": "Roy Jones Jr.",
      "number": "6",
      "records": "55-8, 40 KO",
      "YearsActive": "1989-Present"
    },
    {
      "championships": "Undisputed Middleweight Champion, WBC/WBA/IBF Middleweight Champion",
      "description": [
        "Marvelous Marvin Hagler, that's his legal name, was one of the most dominant middleweights in modern history. His reign as undisputed champion lasted for seven years, from 1980-1987, before he was narrowly, and controversially, defeated by Sugar Ray Leonard in a split decision.\n                      Hagler is known for his granite chin, and he measured up well against other contemporary legends. Even with the loss to Leonard, he holds a decision victory over Roberto Duran and a knockout win over Tommy Hearns in The Ring's 1985 Fight of the Year. "
      ],
      "name": "Marvin Hagler",
      "number": "7",
      "records": "62-3-2, 52 KO",
      "YearsActive": "1973-1987"
    },
    {
      "championships": "Recognized as having won 10 world championships in eight weight divisions (Flyweight, Super Bantamweight, Featherweight, Super Featherweight, Lightweight, Junior Welterweight, Welterweight, Junior Middleweight) ",
      "description": [
        "Manny Pacquiao is the first man in boxing history to win world championships in eight different weight divisions. It is a marvel that a man who began his career at 108 pounds has been able to compete at an elite level in the upper weight classes against other top-level fighters.\n                        Even with his defeat Saturday night at the hands of longtime rival Juan Manuel Marquez, Pacquiao's standing in boxing is secure. It was an absolutely stunning knockout defeat that might signal the end of a great career.  \n                        But there's no reason to hang your head.\n                        There is no shame in losing to a fellow great fighter as long as you stand up to the challenge. And Pacquiao deserves credit for understanding the critics and his place in the sport and choosing to face Marquez four times when most elite-level fighters refused to face him once. "
      ],
      "name": "Manny Pacquiao",
      "number": "8",
      "records": "54-5-2, 38 KO ",
      "YearsActive": "1995-Present"
    },
    {
      "championships": "Five world titles in two weight divisions (IBF/WBC/WBA/WBO Middleweight, WBC Light Heavyweight) ",
      "description": [
        "Bernard Hopkins is a physical marvel, a true freak of nature with a skill set and boxing intelligence that would allow him to compete in any era of the sport.\n                          His list of accomplishments is legendary. Hopkins is a former undisputed middleweight champion who made a record 20 successful defenses of his title, shattering the record previously held by Carlos Monzon.  \n                          Hopkins also is the first fighter to defend, and retain, the world championships of all four major sanctioning bodies and The Ring in one fight. In 2011, he became the oldest man to ever win a world title when at age 46 he outpointed Jean Pascal for the WBC light heavyweight title.\n                          And it's a feat he hopes to replicate sometime next year when he seeks to raise the bar further and win a world championship at age 48."
      ],
      "name": "Bernard Hopkins",
      "number": "9",
      "records": "52-6-2, 2 NC, 32 KO",
      "YearsActive": "1995-Present"
    }
  ]
}