[
  {
    "title": "9. Benny Leonard",
    "text": "<p class=\"\"><strong>Official Record: </strong>90-6-1, 70 KO</p><p class=\"\"><strong>Newspaper Decision</strong>s:&nbsp;93-18-7</p><p class=\"\"><strong>Years Active: </strong>1911-1932</p><p class=\"\"><strong>Championships: </strong>World Lightweight</p><p class=\"\">Benny Leonard was an extremely fast, slick boxer who is considered to be amongst the top lightweight fighters of any era. He is also ranked amongst the smartest in-ring boxers of all time.</p><p class=\"\">Despite his technical prowess and speed, Leonard also had tremendous punching power and registered 70 knockouts in 90 official wins.</p><p class=\"\">He secured the World Lightweight Championship but failed in his attempt to step up to welterweight when he was disqualified for hitting champion Jack Britton while he was down.</p>"
  },
  {
    "title": "8. Jack Dempsey",
    "text": "<p class=\"\"><strong>Official Record: </strong>61-6-9, 34 KO</p><p class=\"\"><strong>Newspaper Decisions: </strong>4-0-2</p><p class=\"\"><strong>Years Active: </strong>1914-1927</p><p class=\"\"><strong>Championships: </strong>World Heavyweight, NBA (later WBA) Heavyweight</p><p class=\"\">In many ways, Jack Dempsey <em>was </em>heavyweight boxing in the late 1910s and early 1920s. He could hit you and hurt you with both hands and had crushing power.&nbsp;</p><p class=\"\">\"The Manassa Mauler\" won the world title from Jess Willard in 1919 and held it until 1926 when he was defeated by Gene Tunney.&nbsp;</p><p class=\"\">A knockout win over Jack Sharkey positioned him for a rematch with Tunney, which he also lost by decision.</p><p class=\"\">Dempsey appears on everyone's lists as one of the best heavyweights of all time.</p>"
  },
  {
    "title": "7. Jack Johnson",
    "text": "<p class=\"\"><strong>Official Record: </strong>53-11-9, 34 KO</p><p class=\"\"><strong>Newspaper Decisions: </strong>14-0-3</p><p class=\"\"><strong>Years Active: </strong>1897-1931</p><p class=\"\"><strong>Championships: </strong>World Colored Heavyweight, World Heavyweight</p><p class=\"\">Jack Johnson is an iconic figure for many reasons—not the least of which was his rising to prominence in the sport at a time when African-American boxers were actively kept out.</p><p class=\"\">Despite being one of the top heavyweights in the world and having won the World Colored Heavyweight Championship, Johnson was not allowed to compete against heavyweight champion James J. Jeffries. The heavyweight title was off limits to black fighters.</p><p class=\"\">Finally, in 1908, six years after Joe Gans had become the first African-American world champion at lightweight, Johnson fought for and won the heavyweight title.&nbsp;</p><p class=\"\">The white boxing community couldn't stand the idea of a black champion and coined the phrase \"great white hope\" to induce white challengers to step up to Johnson.</p><p class=\"\">He defeated several notable ones, including Stanley Ketchel and Jeffries, who came out of retirement only to be dominated by Johnson in the Fight of the Century.</p>"
  },
  {
    "title": "6. Roberto Duran",
    "text": "<p class=\"\"><strong>Record: </strong>103-16, 70 KO</p><p class=\"\"><strong>Years Active: </strong>1968-2001</p><p class=\"\"><strong>Championships: </strong>Five titles in four weight divisions (WBA/WBC Lightweight, WBC Welterweight, WBA Junior Middleweight, WBC Middleweight)</p><p class=\"\">\"Manos de Piedra\" was in his prime a trash-talking, aggressive brawler who fought and beat many of the best of his (and possibly any) era. He is considered by many to be the greatest lightweight fighter in history and held world titles in four weight classes.&nbsp;</p><p class=\"\">Duran's epic career spanned five decades and over 100 professional victories, most notable of which making him the first man to ever defeat Sugar Ray Leonard.</p>"
  },
  {
    "title": "5. Joe Louis",
    "text": "<p class=\"\"><strong>Record: </strong>66-3, 52 KO</p><p class=\"\"><strong>Years Active: </strong>1934-1951</p><p class=\"\"><strong>Championships: </strong>World Heavyweight</p><p class=\"\">\"The Brown Bomber\" Joe Louis' reign as heavyweight champion is legendary. He held the title for 140 months and successfully defended it a record 25 times.</p><p class=\"\">He was known for his punching power, often rating as high as first on all-time rankings, and for becoming the first African-American to achieve mainstream stardom in a United States still brimming with racism.</p><p class=\"\">Louis is well known for a 1936 loss to Max Schmeling, in the Fight of the Year, and for wins over James J. Braddock, Billy Conn, Jersey Joe Walcott and a later first-round knockout of Schmeling to avenge his earlier defeat.&nbsp;</p>"
  },
  {
    "title": "4. Muhammad Ali",
    "text": "<p class=\"\"><strong>Record: </strong>56-5, 37 KO</p><p class=\"\"><strong>Years Active: </strong>1960-1981</p><p class=\"\"><strong>Championships: </strong>WBA Heavyweight (4X), WBC Heavyweight (2X)</p><p class=\"\">\"The Greatest\" is the best heavyweight of all time. Ali fought with a style and a flamboyance that made you either love him or hate him. But regardless of where you come down, nobody can deny his place in boxing history or as a cultural icon.</p><p class=\"\">Ali, then fighting under his birth name of Cassius Clay, won his first heavyweight title at 22 years old against Sonny Liston.&nbsp;</p><p class=\"\">He later converted to Islam and became a controversial figure for refusing to serve in the Vietnam War, a conflict he opposed on religious and moral grounds. Ali was stripped of his heavyweight title and did not fight for four years as a result.</p><p class=\"\">Ali is known for his trilogy with Joe Frazier, losing the first but winning the next two, and for utilizing his famed \"rope-a-dope\" style to upset George Foreman in the Congo in 1974 to regain his titles.</p><p class=\"\">The tactic caused Foreman to expend tremendous energy firing punches in Ali's guard. Most of the shots were deflected or blocked and led to Ali stopping an exhausted Foreman in the eighth round.</p><p class=\"\">In his illustrious career, Ali also holds victories over Bob Foster, Ken Norton, Jimmy Ellis and Floyd Patterson. He is the first man (and thus far, only man) to ever hold the Lineal Heavyweight Championship three times.</p>"
  },
  {
    "title": "3. Willie Pep",
    "text": "<p class=\"\"><strong>Record: </strong>229-11-1, 65 KO</p><p class=\"\"><strong>Years Active: </strong>1940-1966</p><p class=\"\"><strong>Championships: </strong>World Featherweight</p><p class=\"\">Willie Pep is believed to be one of the quickest and most durable fighters in boxing history. His number of fights is huge, even considering the era in which he fought.</p><p class=\"\">Pep won his first 62 professional bouts and was the dominant featherweight fighter of his, and really any, era, holding the title until losing just his second bout against Sandy Saddler in 1948. Pep would avenge the defeat in a rematch and regain his title.</p><p class=\"\">Overall, Pep went 1-3 against Saddler, but dominated virtually every other fighter in his division during this era, leading many to conclude that he's amongst the top fighters in history.</p>"
  },
  {
    "title": "2. Henry Armstrong",
    "text": "<p class=\"\"><strong>Record: </strong>150-21-10, 101 KO</p><p class=\"\"><strong>Years Active: </strong>1931-1945</p><p class=\"\"><strong>Championships: </strong>World Featherweight, World Lightweight, World Welterweight</p><p class=\"\">Henry Armstrong was so good that it's a legitimate coin flip between him and Sugar Ray Robinson for greatest of all time.</p><p class=\"\">Armstrong is one of the few fighters in history to simultaneously hold world championships in three weight divisions. This is made even more impressive given that there were only eight recognized divisions at the time.</p><p class=\"\">Armstrong took on and defeated many of the notable fighters of this era. He won the World featherweight title from Petey Sarron in 1937, but quickly jumped up in weight.&nbsp;</p><p class=\"\">He won the World Welterweight Championship in 1938 from Barney Ross and defended it a record 18 times before controversially dropping it to Fritzie Zivic in 1940.</p><p class=\"\">During his welterweight reign, he also captured the World Lightweight Championship, making him the featherweight, lightweight and welterweight champion at the same time.</p>"
  },
  {
    "title": "1. Sugar Ray Robinson",
    "text": "<p class=\"\"><strong>Record: </strong>173-19-6, 108 KO</p><p class=\"\"><strong>Years Active: </strong>1940-1965</p><p class=\"\"><strong>Championships: </strong>World Welterweight, World Middleweight (5X)</p><p class=\"\">Sugar Ray Robinson is credited with being the reason for the creation of the mythical pound-for-pound rankings that today occupy so much of the debate and discussion that goes on in the boxing world.&nbsp;</p><p class=\"\">Robinson's run is truly remarkable. He was undefeated as an amateur fighter, winning all 85 of his fights, and wasn't defeated until he faced Jake LaMotta in his 41st pro fight. That's a stretch of 126 straight victories and would be unheard of today.</p><p class=\"\">Robinson won the welterweight title in 1946 and held on to it until he jumped to middleweight and took the title there from LaMotta, avenging the earlier defeat.</p><p class=\"\">Sugar Ray spent two-and-a-half years in retirement after failing in his attempt to capture the light heavyweight title from Joey Maxim in 1952. When he returned, he once again captured the middleweight title, something he'd do five times in his illustrious career.</p><p class=\"\">Reading Sugar Ray Robinson's record, you'd think you stumbled into a who's who of fighters during this era. And this era was on par with, and probably superior to, any in boxing history.</p><p class=\"\">He fought, and beat, literally everyone.</p><p class=\"\">Jake LaMotta, Carmen Basilio, Gene Fullmer, Randy Turpin, Carl \"Bobo\" Olson, Henry Armstrong, Rocky Graziano, Kid Gavilan.</p><p class=\"\">Robinson beat them all, and he did it with speed, a tremendous jab and power in both hands. There wasn't a punch in the arsenal he couldn't throw and throw with bad intentions.&nbsp;</p><p class=\"\">There will never be another like him.</p>"
  }
]